In [1]:
import pandas as pd

In [2]:
cars = pd.read_csv(r'C:\Users\shiv\Documents\GitHub\acies-training\12-feb\cars.csv')

In [3]:
cars.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino

In [4]:
cars.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 398 entries, 0 to 397
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           398 non-null    float64
 1   cylinders     398 non-null    int64
 2   displacement  398 non-null    float64
 3   horsepower    392 non-null    float64
 4   weight        398 non-null    int64
 5   acceleration  398 non-null    float64
 6   model_year    398 non-null    int64
 7   origin        398 non-null    object
 8   name          398 non-null    object
dtypes: float64(4), int64(3), object(2)
memory usage: 28.1+ KB

Select the index (row labels) of the DataFrame cars! What kind of index do we have?

In [5]:
cars.index

RangeIndex(start=0, stop=398, step=1)

Set the "name" column as the new index of cars (save the changes)

In [6]:
cars.set_index('name', inplace = True)

Check whether the new index contains only unique values (no duplicates)! Is this the case?

In [7]:
cars.index.is_unique

False

Get the frequency/Counts of all unique values in the index! What is the most frequent value?

In [9]:
cars.index.value_counts() #ford pinto is most frequent

ford pinto                              6
vw rabbit                               5
ford maverick                           5
amc matador                             5
toyota corolla                          5
                                       ..
dodge omni                              1
plymouth volare premier v8              1
ford granada l                          1
chrysler lebaron town @ country (sw)    1
dodge aspen se                          1
Name: name, Length: 300, dtype: int64

Set the name of the index to "car_model"

In [10]:
cars.index.name = 'car_model'

In [11]:
cars.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin
car_model,,,,,,,,
chevrolet chevelle malibu,18.0,8,307.0,130.0,3504,12.0,70,usa
buick skylark 320,15.0,8,350.0,165.0,3693,11.5,70,usa
plymouth satellite,18.0,8,318.0,150.0,3436,11.0,70,usa
amc rebel sst,16.0,8,304.0,150.0,3433,12.0,70,usa
ford torino,17.0,8,302.0,140.0,3449,10.5,70,usa

Reset the index to a RangeIndex and save the change

In [12]:
cars.reset_index(inplace = True)

In [13]:
cars.head()

,car_model,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin
0,chevrolet chevelle malibu,18.0,8,307.0,130.0,3504,12.0,70,usa
1,buick skylark 320,15.0,8,350.0,165.0,3693,11.5,70,usa
2,plymouth satellite,18.0,8,318.0,150.0,3436,11.0,70,usa
3,amc rebel sst,16.0,8,304.0,150.0,3433,12.0,70,usa
4,ford torino,17.0,8,302.0,140.0,3449,10.5,70,usa

Inspect the column Index

In [14]:
cars.columns

Index(['car_model', 'mpg', 'cylinders', 'displacement', 'horsepower', 'weight',
       'acceleration', 'model_year', 'origin'],
      dtype='object')

Rename the column Labels "horsepower" and "origin" to "hp" and "country"

In [18]:
cars.rename({'horsepower':'hp','origin':'country'},axis = 1,inplace = True)

In [19]:
cars.head()

,car_model,mpg,cylinders,displacement,hp,weight,acceleration,model_year,country
0,chevrolet chevelle malibu,18.0,8,307.0,130.0,3504,12.0,70,usa
1,buick skylark 320,15.0,8,350.0,165.0,3693,11.5,70,usa
2,plymouth satellite,18.0,8,318.0,150.0,3436,11.0,70,usa
3,amc rebel sst,16.0,8,304.0,150.0,3433,12.0,70,usa
4,ford torino,17.0,8,302.0,140.0,3449,10.5,70,usa